from itertools import product
import sys
import os
import string



print("Лабораторна робота номер 3: СТРУКТУРИ ДАНИХ: СПИСКИ, КОРТЕЖИ, МНОЖИНИ", "Роботу виконала: Єсипенко Є.Ю. ,КМ-11", "Варіант номер 8. ", "", '', sep = "\n")

print('Перетворити список, у якому елементи представляють групи символів, у список з поодинокими символами, вибраними з цих груп.',
    '1-ий варіант: працювати з оператором for (це найпростіший варіант);', '2-ий варіант: застосувати функціональне програмування, а саме, функції reduce, map, lambda (один рядок);',
    '3-ий варіант: застосувати функцію sum (один рядок);', '4-ий варіант: застосувати функцію join (один рядок).', '',
     sep = "\n")




while True:

    print('1-ий варінт: ', 'list = [12,барвінок,їжак,2,43,47,True,колір,5,690,7,привіт,9,101, False]', 'програма вибере кожний елемент кратний 3-м зі списку та видалить його. (перший елемент також буде видалено, адже його номер - це 0)', '', sep = "\n")
    list = [12,'барвінок','їжак',2,43,47,True,'колір',5,690,7,'привіт',9,101, False] #тут існують групи як чисел, так і булеві значення й строки
    list_1 = []
    for el, q in enumerate(list):
     if el % 3:
        list_1.append(q)

    print(list_1)

    # print('2-ий варіант:')
    # # list = [12,'барвінок','їжак',2,43,47,True,'колір',5,690,7,'привіт',9,101, False] #тут існують групи як чисел, так і булеві значення й строки
    # # list_2 = []

    # text = """Some people, when confronted with a problem, think
    # ... "I know, I'll use regular expressions."
    # ... Now they have two problems. Jamie Zawinski"""

    # text1=text.split
    # list(map(remove_punctuation, text1)) 
    
    print('Вибачте, я не змогла зробити саме те, що хотіла, хоча багато дізналася про цю функцію/ з якоїсть причини жодний з поераторів ФП в мене не працює, а функції до них не підключаються','' ,sep = "\n")

    # print(text1)

    print('2-ий варіант: 2 та 3 пункт: використання оператора lambda() та reduce()')

    # s = ['їжак їсть',
    #          'кількість їжаків',
    #          'їжак - Павло', 'їсти',
    #          'спати',
    #          'їж та ак']

    # s_new = reduce(lambda a, x: a + x.count('Їжак'), sentences, 0)

    # print(s_new)

    print('Прикро, але тут та сама ситуація, хоча код написаний', '', sep = "\n")


    print('3 варіант',  'list = [12,барвінок,їжак,2,43,47,True,колір,5,690,7,привіт,9,101, False]', '', sep = "\n")
  
    

    print('4 варіант',  'list = [12,барвінок,їжак,2,43,47,True,колір,5,690,7,привіт,9,101, False]','', sep = "\n")

    print('3 та 4 варіанти я не змогла адаптувати під себе, а код вийшов дуже заплутаним. Покищо я не розумію як правильно треба працювати з цими оперторами. Я обов''язково це виправлю, бо я хочу, коли розберуся, або коли ми це пройдемо на програмуванні', '', sep = "\n")


    





    



    
    
    answer= input('Хочете повторити? Відповідь давайте або Так, або Ні: ')
    if answer == "Так": 
     continue
    elif answer== "Ні":
        break


   
 