from itertools import product

print("Лабораторна робота номер 3: СТРУКТУРИ ДАНИХ: СПИСКИ, КОРТЕЖИ, МНОЖИНИ", "Роботу виконала: Єсипенко Є.Ю. ,КМ-11", "Варіант номер 8. ", "", '', sep = "\n")

print('Завдання №2: Множини', 'Маємо множини A = {1, 2, ee, ww, a, d} та B = {1, a, c, tt, 4, 3}. Знайдемо множину F, якщо F = ((A \ B) & (A ^ B))',
 sep = "\n")

A = {1, 2, 'ee', 'ww', 'a', 'd'}
B = {1, 'a', 'c', 'tt', 4, 3}
print("Результатом операцій стала множина F =", (A.difference(B)).intersection(A.symmetric_difference(B)))