print("Лабораторна робота номер 1: Програмування лінійних алгоритмів та розгалуджених процесів")
print("Варіант номер 8. Обчислення в математичних задачах")
print ("зАВДАННЯ: З тризначного числа x відняли його останню цифру. Коли результат розділили на 10, а до приватного зліва приписали останню цифру числа x, то вийшло число 237. Знайти число x.")
print("Роботу виконала: Єсипенко Є.Ю. ,КМ-11")

# running = True
# while running:

q=True
r=True
s=True
print("Введіть трьохзначне додатнє число")
print("")
while q:
      nmb = str(input()) 
     # надсилаємо запит на введення


      if (not nmb.isdigit()):
        print ("Аби програма працювала, введіть додатнє число")
        print ("")
     # сортуємо введені дані для правильної роботи алгоритму

        # def var_check(x, lower_bound=99, upper_bound=1000):
        # if lower_bound < x > upper_bound:


      elif (int(nmb)<99) :
            print ("Ваша цифра замала")
            print ("")
     # ставимо границі для числа
     

      elif(int(nmb)>1000):
            print ("Ваша цифра завелика")
            print ("")
     # ставимо границі для числа(2)

     
      else:
            q = False
     # якщо на всі умови введене число відповідає, то програма прериває перевірку
     

# def new_func(input):

#     q = int(input[0])
#     r = int(input[1])
#     s = int(input[2])
#     return q,r,s

print ("Дякую")
print ("")

# далі ми даєио кожному елементу числа його порядковий номер

q = int(nmb[0]) 
r = int(nmb[1])
s = int(nmb[2])
nmb = [q, r, s] #це наше число, що записане у вигляді списку

# q, r, s = new_func(input)

t = int(str(r) + str(s))
x = t*10+q 
# це є соновною дією, що виконує програма - перетворення


print("Ваше число: ", x)
# виводимо число і програма закінчується






#  answer = input("Would you like to run again?")
#     if answer != '':
        # running = False