

print("Лабораторна робота номер 1: Програмування лінійних алгоритмів та розгалуджених процесів")
print("Варіант номер 8. Використання математичних формул за виконанням певних умов")
print("Підрахувати кількість додатних серед чисел а, b, с (ввести з клавіатури).")
print("Роботу виконала: Єсипенко Є.Ю. ,КМ-11")

a=True
b=True
c=True
q=0
print("За допомогою цієї програми, ви можете підрахувати кількість додатніх чисел з трьох введених")
print("")
print ("Введіть першу цифру")

while a:

    value1 = str(input())
    if (not value1.isdigit()  and not value1[0]=="-"): 
    # перевіряємо чи є введене значення числом за допомогою атребут isdigit, та узгоджуємо існування мінуса перед числом


     print ("Аби програма працювала, введіть число")
     print ("")


    elif (value1[0]=="-"): 
    # тепер вказуємо умову для від'ємного значення числа

            q = q + 0
            a = False 
            # переривання

    elif (value1=="0"): 
    # задаємо умову для випадку рівності з нулем

        q = q + 0
        a = False
    elif (value1.isdigit()):
    # у всіх інших випадках число додатнє

        q = q + 1
        a = False

print ("")
print ("Введіть другу цифру")

# далі те ж саме виконується для дрого та третього чисел

while b:
    
    value2 = str(input())
    if (not value2.isdigit()  and not value2[0]=="-"): 
 # перевіряємо чи є введене значення числом за допомогою атребут isdigit, та узгоджуємо існування мінуса перед числом

     print ("Аби програма працювала, введіть число")
     print ("")


    elif (value2[0]=="-"): 
    # тепер вказуємо умову для від'ємного значення числа

            q = q + 0
            b = False 
            # переривання

    elif (value2=="0"): 
    # задаємо умову для випадку рівності з нулем

        q = q + 0
        b = False
    elif (value2.isdigit()):
    # у всіх інших випадках число додатнє

        q = q + 1
        b = False

print ("")
print ("Введіть третю цифру")

while c:
    
    value3 = str(input())
    if (not value3.isdigit()  and not value3[0]=="-"): 
 # перевіряємо чи є введене значення числом за допомогою атребут isdigit, та узгоджуємо існування мінуса перед числом


     print ("Аби програма працювала, введіть число")
     print ("")


    elif (value3[0]=="-"): 
    # тепер вказуємо умову для від'ємного значення числа

        q = q + 0
        c = False 
         # переривання

    elif (value3=="0"): 
    # задаємо умову для випадку рівності з нулем

        q = q + 0
        c = False
        # переривання


    elif (value3.isdigit()):
    # у всіх інших випадках число додатнє

        q = q + 1
        c = False
        # переривання


print ("")
print("Кількість додатніх чисел дорівнює: ", q)

# программа виводить число, що було вираховано та завершується